// Теоретичне питання

// 1.Описати своїми словами кілька рядків, навіщо в програмуванні потрібні цикли.

// Цикли потрібні для того щоб якусь дію або відрізок коду виконати кількість разів необхідну
// для виконання умови задачі.


// Завдання

// Реалізувати програму на Javascript, яка буде знаходити всі числа кратні 5 
// (діляться на 5 без залишку) у заданому діапазоні. 

// Технічні вимоги:

// Зчитати за допомогою модального вікна браузера число, яке введе користувач.
// Вивести в консолі усі числа кратні 5, від 0 до введеного користувачем числа. 
// Якщо таких чисел немає - вивести в консоль фразу Sorry, no numbers.

const userName = prompt('Please enter your name');
const userNumber = prompt(`${userName} , please enter your number `);

let number = parseInt(userNumber);

let found = false
for(let index = 0; index <= number; index++) {
	if(index % 5 === 0) {
		console.log(index);
		found = true;
	}
}